# 1) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 50-დან 200-მდე for loop-ის გამოყენებით.

for i in range (50,200):
    print (i)


# 2) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა ლუწ რიცხვს 1-დან 100-ის ჩათვლით for loop-ის გამოყენებით.

for i in range (3,100,2):
    print(i-1)

# 3) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა კენტ რიცხვს 100-დან 150-მდე for loop-ის გამოყენებით.
 
for i in range (100,150,2):
    print(i+1)

# 4) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 1-დან 50-ის ჩათვლით while loop-ის გამოყენებით.

num = 1
while num < 51:
    print(num)
    num = num + 1
    
    
# 5) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 20-დან 60-ის ჩათვლით, 5-ის გამოტოვებით while loop-ის გამოყენებით.

num = 20
while num < 61:
    print(num)
    num += 5


# 6) მომხმარებელს შემოატანინეთ გვარი. გამოიყენეთ For loop-ი იმისთვის, რომ მისი გვარის თითოეული ასო ცალცალკე გამოიტანოთ ტერმინალში.

surname = 'Kobaidze'
for i in surname:
    print(i)


# 7) დაწერეთ წვენის გაყიდვის პროგრამა სუპერმარკეტისთვის:

juice = 300
while juice > 0:
    print("You have bought the drink")
    juice -= 2
print('Out of stock')



# 8) დაწერეთ For loop-ის პროგრამა, რომელიც 50-დან 20-მდე გამოიტანს რიცხვებს 3-3 რიცხვის გამოკლებით.

for i in range(50,20,-3):
    print(i)
    


# 9) დაწერეთ While loop_ის პროგრამა, რომელიც 150-დან 0-მდე გამოიტანს ყველა რიცხვს.

num = 150
while num >0:
    print(num)
    num -=1


# 10) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს For loop.
 
 # For loop არის პროგრამირების ციკლი რომელიც პროგრამისტს ეხმარება, იმაში რომ ერთი და იგივე მოქმედება რამდენჯერმე ავტომტურად შეასრულოს, ჩვენ მიცემთ ბრძანებას თუ საიდან დაიწყოს ათვლა და სად დაამთავროს. გაიმეოროს მოქმედება სანამ მიცემული ბრძანება არ შესრულდება.

 # 11) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს While loop. რატომ სჭირდება While loop-ს counter ცვლადი და რატომ ვცვლით მის მნიშვნელობას ყოველ იტერაციაზე?

 # While loop არის პროგრამირების ციკლი, რომელიც კოდს ასრულებს მანამ, სანამ მოცემული პირობა მართალია ანუ მანამ სანამ არის True. როდესაც პირობა უკვე მცდარია ციკლი სრულდება.
 # Counter არის ცვლადი, რომელიც ითვლის რამდენჯერ უნდა შესრულდეს ციკლი. ის საჭიროა იმისთვის, რომ ვიცოდეთ როდის უნდა გაჩერდეს ციკლი თავიდან ავიცილოთ უსასრულო ციკლი. თუ ცვლადის მნიშვნლობა არ შეიცვლება მაშინ პრიობა ერთიდაიგივე დარჩება და ციკლი არ დასრულდება.

