# Level01 homework

# 1)
# Python - "პაითონი" - პროგრამირების ენა
print("პაითონი წარმოადგენს მაღალი დონის პროგრამირების დინამიურ ენას შესაძლებლობათა ფართო სპექტრით, რომლის დიზაინი ყურადღებას ამახვილებს კოდის ადვილად წაკითხვადობაზე. პაითონი მულტიპარადიგმული ენაა და მოიცავს როგორც პროცედურული, იმპერატიული, ისე ფუნქციონალური პროგრამირების ელემენტებს. პაითონის მახასიათებელთა შორის აღსანიშნავია: უაღრესად ცხადი, გასაგები და კითხვადი სინტაქსი; ინტროსპექცია; ობიექტ ორიენტირებული მიდგომის მულტიპარადიგმული დიზაინი; სრული მოდულარულობა; მონაცემთა უაღრესად მაღალი დონის ტიპირება; მეტაპროგრამირება; ფართო სტანდარტული ბიბლიოთეკა. პაითონის ინტერპრეტატორი წარმოადგენს ვირტუალურ მანქანას, ამდენად, ეს ენა მულტიპლატფორმულია და პითონზე შექმნილი პროგრამების გაშვება შესაძლებელია პრაქტიკულად ყველა პლატფორმაზე.")

# 2)
# "Print()" ბრძანება - მისი ფუნქცია Python-ში გამოიყენება კონსოლზე შეტყობინების, მონაცემების ან ნებისმიერ ტექსტის გამოსატანად. შეგვიძლია მას გადავცეთ ერთი ან მეტი არგუმენტი, რომლებიც გარდაიქმნება სტრიქონებად და დაიბეჭდება. print() ფუნქცია არის სტანდარტული ბრძანება Python სკრიპტიდან ხილული გამოსავლის გენერირებისთვის.


# 3) Intejer ტიპის ცვლადები:

age01 = 28   # My age
age02 = 30   # My friend's age

print(age01)
print(age02)

# 4) String ტიპის ცვლადები:
name = "Levan"
surname = "Kobaidze"
profession = "Doctor"

print(name + surname + profession)

