# 1) შედარების ოპერატორები - Comparison operations:
# > - მეტია
# < - ნაკლებია
# >= - მეტია ან ტოლია
# <= - ნაკლებია ან ტოლია
# == - უდრის (ამოწმებს როგორც მონაცემს, ასეევე მონაცემების ტიპს)
# != - არ უდრის (ამოწმებს როგორც მონაცემს, ასეევე მონაცემების ტიპს)

# > - მეტია:
print(7 > 5) # True
print(4 > 10) # False

# < - ნაკლებია
print(4 < 3) # False
print(12 < 20) # True

# >= - მეტია ან ტოლია
print(12 >= 8)
print(10 >= 10)

# <= - ნაკლებია ან ტოლია
print(5 <= 12)
print(3 <= 3)

# == - უდრის
print('4' == 4)
print(4 == 4)

# != - არ უდრის 
print('4' != 4)
print(4 != 4)
print('Levan' != 'levan')

# 2) # logical operations - ლოგიკური ოპერატორები

# and - და (მკაცრი ოპერატორი) - რომელიც ამოწმებს True-ს მხოლოდ მაშინ, როცა ორივე პირობა True არის. 
# or - ან (არამკაცრი ოპერატორი) - ამოწმებს True-ს მაშინ, როცა მინიმუმ ერთი პირობა True არის.

# 3) მომხმარებელს შემოატანინეთ სიმაღლე სანტიმეტრებში. ცალკე ცვლადში კი შეინახეთ თქვენი სიმაღლე. დაადგინეთ მომხმარებელი არის თუ არა თქვენზე მაღალი.

Height = input('Enter your Height: ')
my_height = '174cm'
print(Height > my_height)

# 4) დეტალურად ახსენით თუ რატომ გამოიტანს მოცემული კოდი False-ს ტერმინალში:
num1 = "21"
num2 = 21
print(num1 == num2) # ამ შეფთხვევაში num1 ცვლადში შენახული გვაქვს '21' სტრინგის სახით, ხოლო მეორე num2 ცვლადში 21 ინტეჯერ სახითაა, num1 == num2 მიუხედავად იმისა რომ ერთნაირი რიცხვებია ცვლადში შენახული სტრინგი და ინტეჯერი ვერასდროს გაუტოლდება ერთმანეთს, იმიტომ რომ სტინგ ტიპის ცვლად პროგრამა აღიქვამს როგორც სიტყვას, ხოლო ინტეჯერი მთელი რიცხვია, სსიტყვა და რიცხვი ვერ იქნება ერთმანეთის ტოლი.


# 5) ცვლადში შეინახეთ თქვენი გვარი, შემდეგ კი მომხმარებელს შემოატანინეთ მისი გვარი. დაადგინეთ თქვენი და მომხმარებლის გვარები ემთხვევა თუ არა ერთმანეთს.
 
my_surname = 'Kobaidze'
user_surname = input('Enter your surname: ')
print(my_surname == user_surname)


# 6) რას გამოიტანს მოცემული კოდები?

# False or True and True and False        გამოიტანს False-ს
#       True        True          False    

# True and False or False or True       გამოიტანს True-ს 
 #     False               True                 

# True or True and False or True or False and True or False  გამოიტანს True-ს
 #  True     and    False   or True or    False or false
  #          false       or  true     

print(False or True and True and False)
print(True and False or False or True )
print(True or True and False or True or False and True or False)

# 7) დაწერეთ სახლის გაგრილების სისტემის პროგრამა. ვთქვათ, როდესაც სახლში ტემპერატურა 30 გრადუსს ასცდება - ავტომატურად უნდა ჩაირთოს გაგრილების სისტემა. იმის გასაგებად თუ რა ტემპერატურაა სახლში, მომხმარებელს იგი შემოატანინეთ input() ფუნქციის მეშვეობით. (გამოიყენეთ მხოლოდ ლოგიკური ოპერატორები).
temp = 30
ac_on = int(input("turn on ac: "))
print (ac_on > temp)

#8) დაწერეთ ოთახის გაგრილების სისტემის პროგრამა, but there’s a twist: ჩათვალეთ, რომ პროგრამა მხოლოდ იმ შემთხვევაში აღიქვამს ოთახის ტემპერატურას, თუ იგი ფარენგეიტშია გადმოცემული. (სისტემა ჩაირთვება მაშინ, როდესაც ტემპერატურა 89.6 ფარენგეიტს ასცდება). ერთადერთი გასათვალისწინებელი ფაქტი ის არის, რომ მომხმარებელს ოთახის ტემპერატურა გრადუსებში შემოაქვს. ეცადეთ დაწეროთ პირობის მიხედვით ისეთი ოთახის გაგრილების სისტემის პროგრამა, რომელიც სწორად იმუშავებს.
 
temp_f = 89.6
room_tempC = float(input('Enter room temp to celsius: '))
temp_f2 = (room_tempC * 1.8) + 32
ac_on = temp_f2 > temp_f
print(ac_on)